updated_dir/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 3.5e-05;
        value           uniform (0 0 0.179);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    wall
    {
        type            noSlip;
    }
}
