updated_dir/constant/momentumTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
simulationType  laminar;
