updated_dir/system/wallHeatFlux1
type            wallHeatFlux;
libs            ("libfieldFunctionObjects.so");
patches         (wall);
setFormat       csv;
executeControl  writeTime;
writeControl    writeTime;
